---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsLanding
source: html/d66c1394-fc9f-7f13-4320-23e102c041a4.htm
---
# StairsLanding Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.